// 1. 컴포넌트란 무엇인가?
// 웹 애플리케이션의 UI를 이루는 독립적이며 재사용 가능한 코드 조각모음입니다.

// 1.1 재사용성
// 컴포넌트 방식의 가장 큰 장점은 재사용성입니다.
// 한 번 만든 UI 요소(버튼, 입력창, 카드 등)를 여러 곳에서 반복해 사용할 수 있으며, 수정 또한 한 곳에서만 하면 전체 적용됩니다.
// => 코드 중복이 줄고 유지보수 비용이 크게 절감됩니다.

// 1.2 독립적인 상태 관리
// 컴포넌트는 각자 상태(state)를 가지고 있어 UI의 변화와 데이터를 독립적으로 관리할 수 있습니다.
// 예를 들어, 버튼을 눌러 숫자를 증가시키는 기능이나, 입력창에 텍스트가 입력할 때 화면이 바뀌는 동작이 이에 해당됩니다.

// 이를 통해 복잡한 UI라도 구조를 깔끔하게 유지할 수 있습니다.

// 1.3 확장성
// 작은 컴포넌트들을 조합하여 더 큰 UI를 만들 수 있습니다.
// 마치 레고 블록이 쌓여 건물이 되는 것처럼, 컴포넌트 + 컴포넌트 = 새로운 컴포넌트

// ========== * ========== * ========== * ========== * ========== * ========== * ========== * ========== * ========== * ==========

// 2. Props
// 리액트에서 컴포넌트 간 데이터 전달하는 방식은 Props(프로퍼티)입니다.
// props는 부모 컴포넌트가 자식 컴포넌트에 값을 넘겨줄 때 사용합니다.
// 즉, 위에서 아래로 데이터를 전달하는 방법입니다.

// 2.1 Props 특징
// 2.1.1 단방향 데이터 흐름
// Props는 부모 -> 자식으로만 흐릅니다. 이 흐름이 한 방향이기 때문에 데이터 구조가 예측 가능해지고, 버그가 줄어듭니다.

// 2.1.2 읽기 전용
// 자식 컴포넌트는 Props를 수정할 수 없습니다. 읽기 전용(Read-only)이기 때문에 관리가 명확하고 안정적입니다.

// 2.2 Props Drilling과 상태 관리 도구의 등장
// 프로젝트가 커질 수록 Props를 여러 단걔로 전달해야 하는 상황이 생길 수 있습니다.
// 이를 Props Drilling이라고 합니다.

// 이 문제를 해결하기 위해 Redux, Recoil, Zustand, Jotai 등과 같은 상태 관리 도구가 등장했습니다.
// 이 도구들은 공통되는 상태(값)를 한 곳에서 관리하고 필요한 컴포넌트가 꺼내 쓸 수 있도록 하여
// 복잡한 데이터 흐름을 단순하게 만들어줍니다.

// ========== * ========== * ========== * ========== * ========== * ========== * ========== * ========== * ========== * ==========

// 3. 상태(state)란 무엇인가?
// 상태(state)는 "화면(UI)의 모양을 결정짓는 데이터"를 의미합니다.
// 예를 들어, 로그인 여부, 입렵창의 값, 버튼 클릭 횟수, 상품 목록 데이터 등 이런 값들이 상태입니다.
// 즉, 상태(state)는 UI를 바꾸는 힘을 가진 데이터라고 할 수 있습니다.

// 3.1 상태 관리란 무엇인가?
// 상태 관리란, 이런 데이터를 저장하고, 변경하고, 필요한 곳에서 사용하는 것을 체걔적으로 다루는 과정을 말합니다.
// 작은 규모의 애플리케이션이라면 각 컴포넌트 내부에서 useState, useReducer로 충분히 관리할 수 있습니다.
// 하지만 프로젝트가 커질 수록 문제가 생깁니다.

// 3.2 상태 관리가 어려워지는 이유
// 3.2.1 상태의 공유가 필요해짐
// 처음에는 컴포넌트 내부에서만 쓰이는 데이터였지만, 점점 여러 컴포넌트가 같은 상태를 공유해야 하는 상황이 생깁니다.

// 예를 들어,
// - 로그인 정보(사용자 이름, 권한)는 모든 페이지에서 필요합니다.
// - 장바구니 상태는 상품 목록, 결제 페이지, 헤더 아이콘 모두에서 사용됩니다.

// 3.2.2 Props Drilling 문제
// 부모 -> 자식 -> 자식 -> 작식 식으로 같은 데이터를 계속 전달해야 하는 현상을 Props Drilling이라고 합니다.

// const user = {}

// <App props={user}/>
// -> <Header props={user} />
// -> -> <UserInfo props={user} />
// -> -> -> <UserProfile props={user} />

// 여러 컴포넌트가 공유하는 "공통 상태"를 한 곳에서 관리하고,
// 필요한 컴포넌트가 쉽게 접근하고 수정할 수 있도록 도와주는 도구

// [역할]
// - 전역(Global) 상태 저장소 제공 ✅
// - Props 전달 없이 상태 공유 가능 ✅
// - 상태 변경 시 필요한 컴포넌트만 자동 업데이트 ✅
// - 예측 가능한 데이터 흐름 유지 ✅

function App() {
    return <div>App</div>
}

export default App
